In [ ]:
Question 1-  For an online purchasing database, create entity relationship diagrams. Create a database object 
             from your entity diagram.

Ans-
    
    Sure, I can help you create an entity-relationship diagram (ERD) for an online purchasing database and then
    create a corresponding database object based on that diagram. 

Let's start by identifying some key entities in an online purchasing system:

1. **User**: Represents the users of the system.
2. **Product**: Represents the products available for purchase.
3. **Order**: Represents an order placed by a user.
4. **Payment**: Represents the payment details associated with an order.
5. **Address**: Represents the delivery address for an order.

Based on these entities, we can create the following ERD:

```
     +-----------+       +-------------+        +---------+
     |   User    |       |   Product   |        | Address |
     +-----------+       +-------------+        +---------+
     | UserID    |1--*-o| ProductID   |1--*-o  | AddressID|
     | Username  |       | Name        |        | Street  |
     | Email     |       | Price       |        | City    |
     | Password  |       | Description |        | State   |
     | ...       |       | ...         |        | Zip     |
     +-----------+       +-------------+        +---------+
           |                   |
           |  1--*             |
           |                   |
           |                   |
           o--* Order *--o Payment
                    |
                    |
                    o--o Address
```

Here's a description of the relationships:

- A **User** can place multiple orders (1--*), but each order is placed by exactly one user (*--1).
- An **Order** can have multiple products (1--*) and each product can be part of multiple orders (*--*).
- An **Order** can have exactly one payment (1--1), but a payment can be associated with only one order (*--1).
- An **Order** can have exactly one delivery address (1--1), but an address can be associated with multiple orders (*--1).

Now, let's create a simple database object using SQL to represent this ERD:

```sql
CREATE TABLE User (
    UserID INT PRIMARY KEY,
    Username VARCHAR(50),
    Email VARCHAR(100),
    Password VARCHAR(100),
    -- Other user attributes
);

CREATE TABLE Product (
    ProductID INT PRIMARY KEY,
    Name VARCHAR(100),
    Price DECIMAL(10,2),
    Description TEXT,
    -- Other product attributes
);

CREATE TABLE Address (
    AddressID INT PRIMARY KEY,
    Street VARCHAR(255),
    City VARCHAR(100),
    State VARCHAR(50),
    Zip VARCHAR(20),
    -- Other address attributes
);

CREATE TABLE Order (
    OrderID INT PRIMARY KEY,
    UserID INT,
    AddressID INT,
    FOREIGN KEY (UserID) REFERENCES User(UserID),
    FOREIGN KEY (AddressID) REFERENCES Address(AddressID),
    -- Other order attributes
);

CREATE TABLE Payment (
    PaymentID INT PRIMARY KEY,
    OrderID INT,
    FOREIGN KEY (OrderID) REFERENCES Order(OrderID),
    -- Other payment attributes
);

CREATE TABLE Order_Product (
    OrderID INT,
    ProductID INT,
    PRIMARY KEY (OrderID, ProductID),
    FOREIGN KEY (OrderID) REFERENCES Order(OrderID),
    FOREIGN KEY (ProductID) REFERENCES Product(ProductID)
);
```

This SQL script creates tables for User, Product, Address, Order, Payment, and Order_Product, along with appropriate
foreign key constraints to maintain referential integrity.
    
    
    
    
    
    
    
    
Question 2-  Create a SQL store process to register the use of the database, complete it with proper validation and
transaction rollback and commit.


Ans-


Sure, here's an example of a stored procedure in SQL Server that registers a new user in the database with proper
validation and transaction management:

```sql
CREATE PROCEDURE RegisterUser
    @Username VARCHAR(50),
    @Email VARCHAR(100),
    @Password VARCHAR(100)
AS
BEGIN
    SET NOCOUNT ON;
    
    -- Check if the email is already registered
    IF EXISTS (SELECT 1 FROM [User] WHERE Email = @Email)
    BEGIN
        RAISEERROR ('Email is already registered.', 16, 1)
        RETURN;
    END

    -- Begin transaction
    BEGIN TRANSACTION;

    -- Insert new user
    INSERT INTO [User] (Username, Email, Password)
    VALUES (@Username, @Email, @Password);

    -- Check if the user was successfully inserted
    IF @@ERROR <> 0
    BEGIN
        -- Rollback transaction if error occurred
        ROLLBACK TRANSACTION;
        RAISEERROR ('Error occurred while registering user.', 16, 1)
    END
    ELSE
    BEGIN
        -- Commit transaction if successful
        COMMIT TRANSACTION;
        PRINT 'User successfully registered.';
    END
END;
```

This stored procedure `RegisterUser` takes three parameters: `@Username`, `@Email`, and `@Password`. It first
    checks if the provided email is already registered in the database. If the email is not found, it begins a
    transaction and inserts the new user into the `User` table. If any error occurs during the insertion, it rolls
    back the transaction and raises an error. Otherwise, it commits the transaction and prints a success message.

You can execute this stored procedure to register a new user by providing the required parameters like so:

```sql
EXEC RegisterUser @Username = 'JohnDoe', @Email = 'john@example.com', @Password = 'password123';
```

Remember to adjust the syntax and error handling as needed based on the specific SQL database you're using.





Question 3-  List the SQL aggregate function and demonstrate how to utilize it.


Ans-



SQL provides several aggregate functions that perform calculations on a set of values and return a single value. 
Here are some common SQL aggregate functions:

1. **COUNT**: Counts the number of rows in a set.
2. **SUM**: Calculates the sum of values in a set.
3. **AVG**: Calculates the average of values in a set.
4. **MIN**: Returns the minimum value in a set.
5. **MAX**: Returns the maximum value in a set.

Let's demonstrate how to use these aggregate functions with a hypothetical "Orders" table:

```sql
-- Sample Orders table
CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    ProductName VARCHAR(100),
    Quantity INT,
    Price DECIMAL(10,2)
);

-- Insert some sample data
INSERT INTO Orders (OrderID, ProductName, Quantity, Price)
VALUES
    (1, 'ProductA', 5, 10.00),
    (2, 'ProductB', 3, 15.50),
    (3, 'ProductA', 2, 10.00),
    (4, 'ProductC', 4, 8.75),
    (5, 'ProductB', 1, 15.50);
```

Now, let's demonstrate the usage of aggregate functions:

1. **COUNT** - Count the number of orders:

```sql
SELECT COUNT(*) AS TotalOrders FROM Orders;
```

2. **SUM** - Calculate the total price of all orders:

```sql
SELECT SUM(Price) AS TotalPrice FROM Orders;
```

3. **AVG** - Calculate the average quantity of products:

```sql
SELECT AVG(Quantity) AS AvgQuantity FROM Orders;
```

4. **MIN** - Find the minimum quantity among orders:

```sql
SELECT MIN(Quantity) AS MinQuantity FROM Orders;
```

5. **MAX** - Find the maximum price among orders:

```sql
SELECT MAX(Price) AS MaxPrice FROM Orders;
```

These queries demonstrate the use of SQL aggregate functions to perform calculations on the data in the "Orders" table.
Keep in mind that you can apply these aggregate functions in combination with the `GROUP BY` clause to perform 
calculations on subsets of data based on certain criteria.





Question 4-  In SQL, create a pivot query.



Ans-

Certainly! A pivot query in SQL is used to transform rows of data into columns, typically to achieve a 
cross-tabulation effect. Here's an example of how to create a pivot query:

Let's say we have a table named `Sales` with the following structure and data:

```sql
CREATE TABLE Sales (
    ProductName VARCHAR(50),
    SalesDate DATE,
    Amount DECIMAL(10, 2)
);

INSERT INTO Sales (ProductName, SalesDate, Amount)
VALUES
    ('ProductA', '2023-01-01', 100.00),
    ('ProductB', '2023-01-02', 150.00),
    ('ProductA', '2023-01-03', 120.00),
    ('ProductB', '2023-01-04', 200.00),
    ('ProductA', '2023-01-05', 130.00);
```

Now, let's say we want to pivot this data to show total sales amount for each product by month. We can achieve
this using a pivot query:

```sql
SELECT *
FROM (
    SELECT ProductName, 
           MONTH(SalesDate) AS MonthNumber,
           DATENAME(MONTH, SalesDate) AS MonthName,
           Amount
    FROM Sales
) AS SourceTable
PIVOT (
    SUM(Amount)
    FOR MonthNumber IN ([1] AS January, [2] AS February, [3] AS March, [4] AS April, [5] AS May, [6] AS June,
                        [7] AS July, [8] AS August, [9] AS September, [10] AS October, [11] AS November, [12] AS December)
) AS PivotTable;
```

This query will pivot the data in the `Sales` table to show total sales amounts for each product by month. The `PIVOT`
keyword is used to specify the aggregation function (`SUM` in this case) and the columns to pivot on (in this case,
the `MonthNumber` derived from the `SalesDate` column). The result will have columns for each month showing the 
total sales amount for each product.

Note:  Microsoft SQL Server. Other database systems like PostgreSQL or 
       Oracle may have different syntax for pivot queries.

    
    
    
    
    
    
Question 5-  With an example, describe how to join in SQL.



Ans-



Certainly! In SQL, the `JOIN` operation is used to combine rows from two or more tables based on a related column 
between them. There are several types of joins in SQL, including `INNER JOIN`, `LEFT JOIN` (or `LEFT OUTER JOIN`),
`RIGHT JOIN` (or `RIGHT OUTER JOIN`), and `FULL JOIN` (or `FULL OUTER JOIN`). Here's an example of how to use
`INNER JOIN` with an example:

Consider two tables:

1. `Students` table:
```sql
CREATE TABLE Students (
    StudentID INT PRIMARY KEY,
    Name VARCHAR(50),
    Age INT,
    DepartmentID INT
);

INSERT INTO Students (StudentID, Name, Age, DepartmentID)
VALUES
    (1, 'John', 20, 1),
    (2, 'Alice', 22, 2),
    (3, 'Bob', 21, 1),
    (4, 'Emma', 23, 3);
```

2. `Departments` table:
```sql
CREATE TABLE Departments (
    DepartmentID INT PRIMARY KEY,
    DepartmentName VARCHAR(50)
);

INSERT INTO Departments (DepartmentID, DepartmentName)
VALUES
    (1, 'Computer Science'),
    (2, 'Mathematics'),
    (3, 'Physics');
```

Suppose we want to retrieve the names of students along with their department names. We can achieve this by 
using an `INNER JOIN` between the `Students` and `Departments` tables:

```sql
SELECT Students.Name AS StudentName, Departments.DepartmentName
FROM Students
INNER JOIN Departments ON Students.DepartmentID = Departments.DepartmentID;
```

Explanation:
- The `INNER JOIN` clause combines rows from both tables where there is a match on the specified condition
(`Students.DepartmentID = Departments.DepartmentID`).
- The `ON` keyword specifies the condition for the join.
- In this case, we're joining the `Students` table with the `Departments` table based on the `DepartmentID` column,
  which is common to both tables.
- The result set will include the `Name` column from the `Students` table and the `DepartmentName`
column from the `Departments` table, showing the name of each student along with their corresponding department name.

The result of the query would be something like this:

```
+-------------+-------------------+
| StudentName | DepartmentName    |
+-------------+-------------------+
| John        | Computer Science  |
| Alice       | Mathematics       |
| Bob         | Computer Science  |
| Emma        | Physics           |
+-------------+-------------------+
```

This is a basic example of how to use the `INNER JOIN` operation in SQL to combine data from multiple tables based
on a common column. Depending on the requirements, you can use different types of joins to achieve different results.




Question 6-  How to locate the 4th highest value in a column in a row. Create your table.



Ans-


To locate the 4th highest value in a column within a row, you can use the `ROW_NUMBER()` window function along with the
`ORDER BY` clause to rank the values in the column and then filter based on the rank. Here's how you can do it:

Let's create a sample table named `Scores`:

```sql
CREATE TABLE Scores (
    ID INT PRIMARY KEY,
    Score INT
);

INSERT INTO Scores (ID, Score)
VALUES
    (1, 80),
    (2, 95),
    (3, 75),
    (4, 85),
    (5, 90);
```

Now, to locate the 4th highest value in the `Score` column, you can use the following query:

```sql
SELECT Score
FROM (
    SELECT Score, ROW_NUMBER() OVER (ORDER BY Score DESC) AS RowNum
    FROM Scores
) AS RankedScores
WHERE RowNum = 4;
```

Explanation:
- The inner query (`SELECT Score, ROW_NUMBER() OVER (ORDER BY Score DESC) AS RowNum FROM Scores`) retrieves
the `Score` column along with the row number (`RowNum`) assigned to each score based on their descending order
(`ORDER BY Score DESC`).
- The outer query selects the `Score` where the `RowNum` is equal to 4, indicating the 4th highest value in the 
`Score` column.

The result of the query will be:

```
+-------+
| Score |
+-------+
|    85 |
+-------+
```

In this example, the 4th highest value in the `Score` column is 85. Adjust the table and column names as needed for 
your specific scenario.